#+title: Planning

* Code Snippets

** i64 Max
#+begin_src rust
fn main() {
    println!("{}", i64::MAX);

}
#+end_src

#+RESULTS:
: 9223372036854775807

The highest a number can go is 10^{9223372036854775807}.

** Vector Order Test
#+begin_src rust
fn main() {
    let mut test: Vec<i64> = vec![];
    for i in 1..10 {
        test.push(i);
    }

    println!("{:?}",test);

    let a = 'a';
    let b = '0';

    assert

}
#+end_src

#+RESULTS:
: [1, 2, 3, 4, 5, 6, 7, 8, 9]
